Конфигурация/Documents/Оплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Оплата</Name>
			<BasedOn>
				<xr:Item>Document.Сделка</xr:Item>
				<xr:Item>Document.СделкаРЕПО</xr:Item>
				<xr:Item>Document.ПогашениеЦеннойБумаги</xr:Item>
				<xr:Item>Document.НачислениеДивидендов</xr:Item>
				<xr:Item>Document.ПогашениеКупона</xr:Item>
				<xr:Item>Document.НачислениеЗадолженности</xr:Item>
				<xr:Item>Document.СделкаСВалютой</xr:Item>
				<xr:Item>Document.ВводЦенныхБумаг</xr:Item>
				<xr:Item>Document.ЗакрытиеКредитногоИнструмента</xr:Item>
				<xr:Item>Document.Маржа</xr:Item>
				<xr:Item>Document.ОтменаСделки</xr:Item>
				<xr:Item>Document.РешениеОбИзмененииУставногоКапиталаООО</xr:Item>
				<xr:Item>Document.ПриходПроцентовПоКредитномуИнструменту</xr:Item>
				<xr:Item>Document.РаспределениеДоходаПайщикам</xr:Item>
				<xr:Item>Document.ПоручениеНаДвижениеДенежныхСредств</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.РезервыПИФ</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствамПоПоручениям</xr:Item>
				<xr:Item>AccumulationRegister.РезервыПредстоящихРасходов</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПС</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКупленныеПоРЕПО</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.ПлановыеДатыОплат</xr:Item>
				<xr:Item>InformationRegister.РеестрПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбеспечительныйПлатеж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчетЕПС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Единый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлановогоПогашенияЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>25</v8:Digits>
									<v8:FractionDigits>20</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СобственныйКурсОплаты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплатыКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ВидыАкцептов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыАкцептов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СписаниеКомиссииБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБрокерскойКомиссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеТорговойКомиссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводСБрокерскогоСчетаНаРасчетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласиеНаОферту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаВыводАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНОСрочный30Дней4ПроцентаУКПИ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/Оплата/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Объект.ПометкаУдаления Тогда // "отказ" при обработке заполнения
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Объект.Комментарий,,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ТипЗнч(ЭтаФорма.Параметры.Основание) = Тип("ДокументСсылка.РаспределениеДоходаПайщикам") 
			И ЗначениеЗаполнено(ЭтаФорма.Параметры.Основание.Основание) Тогда
			ЭтаФорма.ДокументОснование = ЭтаФорма.Параметры.Основание.Основание; // возможно, потребуется для интерактивного выбора задолженности
		Иначе
			ЭтаФорма.ДокументОснование = ЭтаФорма.Параметры.Основание; // возможно, потребуется для интерактивного выбора задолженности
		КонецЕсли;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(ЭтаФорма.ДокументОснование) И Не ЗначениеЗаполнено(Объект.ВидДвижения) Тогда // требуется интерактивный выбор списываемой задолженности
		ПараметрыПодбора = Новый Структура("МножественныйВыбор, ЗакрыватьПустой, Организация, СчетДоверительногоУправления, Брокер, МестоХранения, Основание, РасчетныйСчет");
		ЗаполнитьЗначенияСвойств(ПараметрыПодбора, Объект);
		
		ПараметрыПодбора.МножественныйВыбор = Истина;
		ПараметрыПодбора.ЗакрыватьПустой    = Истина;
		ПараметрыПодбора.Основание          = ЭтаФорма.ДокументОснование;
		
		ХранилищеВыбЗадолженности = ОткрытьФормуМодально("ОбщаяФорма.ПодборЗадолженностиПоДенежнымСредствам", ПараметрыПодбора, ЭтаФорма);
		
		Если ТипЗнч(ХранилищеВыбЗадолженности) = Тип("ХранилищеЗначения") Тогда
			Если Не ЗаполнитьОснованияОстаткамиЗадолженностиНаСервере(ХранилищеВыбЗадолженности, Истина) Тогда
				Предупреждение("При подборе следует выбирать только один тип и вид задолженности по одному счету д/у.");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ОснованияПриИзменении(Неопределено);
		
		НастроитьВидимостьИДоступность(ЭтаФорма);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Для каждого СтрокаОснования Из Объект.Основания Цикл
			КурсВалютыОплаты = ?(СтрокаОснования.СобственныйКурсОплаты,СтрокаОснования.КурсОплаты,Объект.Дата);	
			СтрокаОснования.СуммаОплаты = РаботаСВалютами.ПересчетСуммыВВалюте(СтрокаОснования.Сумма, СтрокаОснования.Валюта, КурсВалютыОплаты, Объект.ВалютаОплаты, Объект.Дата); 
			СтрокаОснования.СуммаОплатыКупона = РаботаСВалютами.ПересчетСуммыВВалюте(СтрокаОснования.СуммаКупона, СтрокаОснования.Валюта, КурсВалютыОплаты, Объект.ВалютаОплаты, Объект.Дата); 
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.ОплатаЧерезБрокера = ЗначениеПереключателяБрокер() Тогда
		ПроверяемыеРеквизиты.Добавить("Брокер");
	КонецЕсли;
	
	Если ЭтаФорма.ДетализацияПоРасчетномуСчету
		И ЭтаФорма.ОплатаЧерезБрокера <> ЗначениеПереключателяБиржа()
	Тогда
		ПроверяемыеРеквизиты.Добавить("РасчетныйСчет");
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	ЗаполнитьРасчетныеПоляОснованийНаСервере();
	ЗаполнитьПодтверждениеОперацииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	Если      Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоПогашениюКупона") Тогда
		Оповестить("СводноеПогашениеКупона.Обновить", Объект.Ссылка);
	ИначеЕсли Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоПогашениюОблигации") Тогда
		Оповестить("СводноеПогашениеОблигации.Обновить", Объект.Ссылка);
	ИначеЕсли Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции") 
		или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи")
		или Объект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки") Тогда
		Оповестить("СводноеНачислениеДивидендов.Обновить", Объект.Ссылка);
	КонецЕсли;
	
	Оповестить("БанковкиеВыписки.Обновить", Объект.Ссылка);
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") И ИсточникВыбора.ИмяФормы = "Документ.СтрокаБанковскойВыписки.Форма.БанковкиеВыписки" Тогда
		Если ИсточникВыбора.ИсточникВыбора = "СтрокаБанковскойВыписки" Тогда
			
			Объект.СтрокаБанковскойВыписки   = ВыбранноеЗначение;
			ЭтаФорма.СтрокаБанковскойВыписки = РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыписки);
			
		КонецЕсли;
		
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперацииНаСервере();
		КонецЕсли; 	
	Иначе		
		РаботаСДокументамиКлиент.ОбработкаОповещенияФормыДокумента(ЭтаФорма, Объект.Ссылка, ИмяСобытия, Параметр, Источник);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммыОплатыНаСервере()
	
	Для Каждого СтрокаОснования Из Объект.Основания Цикл
		
		Если СтрокаОснования.СобственныйКурсОплаты Тогда
			
			Если Не ЗначениеЗаполнено(СтрокаОснования.КурсОплаты) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаОснования.НомерСтроки  + " не указан курс оплаты.");	
			КонецЕсли;
			
			Продолжить;
		Иначе
			
			Если СтрокаОснования.Сумма <> 0 Тогда
				СтрокаОснования.СуммаОплаты = РаботаСВалютами.ПересчетСуммыВВалюте(СтрокаОснования.Сумма, СтрокаОснования.Валюта, Объект.Дата, Объект.ВалютаОплаты, Объект.Дата);
			КонецЕсли;
			
			Если СтрокаОснования.СуммаКупона <> 0 Тогда 
				СтрокаОснования.СуммаОплатыКупона = РаботаСВалютами.ПересчетСуммыВВалюте(СтрокаОснования.СуммаКупона, СтрокаОснования.Валюта, Объект.Дата, Объект.ВалютаОплаты, Объект.Дата);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
 
#КонецОбласти

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	Если Не ПроверитьНаличиеЗадолженностиНаСервере() Тогда
		КомандаОчиститьОснования(Неопределено);
	КонецЕсли;
		
	РаботаСДокументамиКлиент.ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов(ЭтаФорма);
	
	Если Не РаботаСИсполнителями.ЕстьИсполнитель(?(ЭтаФорма.ОплатаЧерезБрокера = 1, "ИсполнителиПоДенежнымСредствамБрокерские", "ИсполнителиПоДенежнымСредствамСобственные"),
		ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, Брокер, РасчетныйСчет"))
	Тогда
		Объект.РасчетныйСчет = Неопределено;
	КонецЕсли;
	
	ПересчитатьСуммыОплатыНаСервере(); 	
	
	ЗаполнитьРасчетныеПоляОснованийНаСервере();
	ЗаполнитьНастройкиОтображенияНаСервере();
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДвиженияПриИзменении(Элемент)
	
	//Пока не отработаны авансы полученные для клиента.
	Если Объект.ВидДвижения = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Приход") Тогда
		Объект.Аванс = Ложь;	
	КонецЕсли; 
	
	КомандаОчиститьОснования(Неопределено);
	
	НастроитьВидимостьИДоступность(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	КомандаОчиститьОснования(Неопределено);
	// !!! ВРЕМЕННО НЕ ПРОВЕРЯЕМ (09.10.2024)
	//ОбновитьНеобходимостьПроверкиРеквизитаДоговор();
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	// !!! ВРЕМЕННО НЕ ПРОВЕРЯЕМ (09.10.2024)
	//ОбновитьНеобходимостьПроверкиРеквизитаДоговор();
КонецПроцедуры

&НаКлиенте
Процедура ОплатаЧерезБрокераПриИзменении(Элемент)
	
	Объект.Брокер		 = Неопределено;
	Объект.МестоХранения = Неопределено;
	
	Если ЭтаФорма.ОплатаЧерезБрокера = ЗначениеПереключателяБиржа() Тогда
		Объект.МестоХранения			 = ПредопределенноеЗначение("Справочник.МестаХранения.ММВБ_ДепозитыСЦК");
		Объект.СтрокаБанковскойВыписки	 = Неопределено;
		ЭтаФорма.СтрокаБанковскойВыписки = РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыписки);
	КонецЕсли;
	
	БрокерПриИзменении(Элемент);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура БрокерПриИзменении(Элемент)
	
	КомандаОчиститьОснования(Неопределено);
	
	РаботаСДокументамиКлиент.ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	
	КомандаОчиститьОснования(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗадолженностиПриИзменении(Элемент)
	
	КомандаОчиститьОснования(Неопределено);
	
	Если Объект.ВидЗадолженности <> ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ОшибочноеСписание")
		И Объект.ВидЗадолженности <> ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоПрочимУслугам") Тогда
		
		Объект.КоррСчет = ПредопределенноеЗначение("ПланСчетов.Основной.ПустаяСсылка");
		КоррСчетПриИзменении(Элемент);
		
		Объект.КоррСчетЕПС = ПредопределенноеЗначение("ПланСчетов.Единый.ПустаяСсылка");
		КоррСчетЕПСПриИзменении(Элемент);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ВидЗадолженности) И ЗначениеЗаполнено(Объект.Поручение) Тогда
		
		Если Не ДоступноСозданиеОплатыПоВидуЗадолженностиНаОснованииПоручения(Объект.ВидЗадолженности)
			И Вопрос("Нельзя создавать оплату с видом задолженности [" + Объект.ВидЗадолженности + "] на основании поручения. Очистить значение поля [Поручение]?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			
			Объект.Поручение = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма, Элемент);
	
	Если Объект.Основания.Количество() > 0 Тогда
		ОбновитьИтоговуюСтрокуОснований(ЭтаФорма);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда
		ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Объект.ВалютаОплаты <> ВалютаРасчетногоСчета Тогда
		
		Объект.ВалютаОплаты = ВалютаРасчетногоСчета;
		ВалютаОплатыПриИзменении(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОплатыПриИзменении(Элемент)
	
	//Для прочих доходов и расходов документ-основание не заполняется и валюта сделки = валюте оплаты
	Для Каждого СтрокаОснования Из Объект.Основания Цикл
		
		Если(СтрокаОснования.Валюта <> Объект.ВалютаОплаты) И НЕ ЗначениеЗаполнено(СтрокаОснования.Основание) Тогда
			СтрокаОснования.Валюта = Объект.ВалютаОплаты;
		КонецЕсли;
		
	КонецЦикла;
	
	ПересчитатьСуммыОплатыНаСервере();
	ЗаполнитьНастройкиОтображенияНаСервере();
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОплатыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВыбранноеЗначение, Объект.ВалютаОплаты, Объект.РасчетныйСчет);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаБанковскойВыпискиНажатие(Элемент, СтандартнаяОбработка)
	
	ПолнаяСуммаОплаты = 0;
	
	Для каждого СтрокаОснования Из Объект.Основания Цикл
		ПолнаяСуммаОплаты = СтрокаОснования.Сумма + СтрокаОснования.СуммаКупона;
	КонецЦикла;
	
	РаботаСБанковскимиВыпискамиКлиентСервер.ВыполнитьДействиеСоСтрокойБанковскойВыписки(
		Новый Структура("Период, Организация, РасчетныйСчет, ВидДвижения, Сумма, Контрагент, РасчетныйСчетКонтрагента",
			Объект.Дата,
			Объект.Организация,
			Объект.РасчетныйСчет,
			Объект.ВидДвижения,
			ПолнаяСуммаОплаты,
			Объект.Контрагент,
			Объект.РасчетныйСчетКонтрагента),
		"СтрокаБанковскойВыписки",
		ЭтаФорма,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АвансПриИзменении(Элемент)
		
	КомандаОчиститьОснования(Неопределено);
	
	Если НЕ Объект.Аванс Тогда
		Объект.ОбеспечительныйПлатеж = Ложь;
		Объект.ДатаПлановогоПогашенияЗадолженности = Дата(1,1,1,0,0,0);
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбеспечительныйПлатежПриИзменении(Элемент)
	
	Если Объект.ОбеспечительныйПлатеж и НЕ Объект.Аванс = Истина Тогда
		
		Объект.Аванс = Истина;
		
		КомандаОчиститьОснования(Неопределено);
		НастроитьВидимостьИДоступность(ЭтаФорма, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоррСчетПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.Организация, Объект.КоррСчет);
	
	Для Инд = 1 По 3 Цикл
		Если НЕ ЭтаФорма.Элементы["Субконто" + Строка(Инд)].Доступность Тогда
			Объект["Субконто" + Строка(Инд)] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КоррСчетЕПСПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконтоЕПС(ЭтаФорма, Объект.Организация, Объект.КоррСчетЕПС);
	
	Для Инд = 1 По 3 Цикл
		Если НЕ ЭтаФорма.Элементы["СубконтоЕПС" + Строка(Инд)].Доступность Тогда
			Объект["Субконто" + Строка(Инд)] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ТЧ_ОСНОВАНИЯ

&НаКлиенте
Процедура ОснованияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Валюта) Тогда
		ТекущиеДанные.Валюта = Объект.ВалютаОплаты;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияПриИзменении(Элемент)
	
	ОбновитьИтоговуюСтрокуОснований(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияОснованиеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Основания.ТекущиеДанные;
	ТипОснования  = ТипЗнч(ТекущиеДанные.Основание);
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Основание) Тогда
		Если ТипОснования <> Тип("Неопределено") Тогда
			Возврат;
		Иначе	
			ТекущиеДанные.Валюта = Объект.ВалютаОплаты;
		КонецЕсли;	
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.Сделка") Или ТипОснования = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		Если Объект.ВидЗадолженности <> ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода") Тогда
			ТекущиеДанные.Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Основание, "ВалютаСделки");              	
		Иначе
			ТекущиеДанные.Валюта = ПолучитьВалютуВозвратногоКупона(ТекущиеДанные.Основание, Объект.Организация, Объект.СчетДоверительногоУправления);
		КонецЕсли;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.НачислениеЗадолженности") или ТипОснования = Тип("ДокументСсылка.ВводЦенныхБумаг") Тогда
		ТекущиеДанные.Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Основание, "Валюта");
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.НачислениеДивидендов") или ТипОснования = Тип("ДокументСсылка.ПогашениеКупона") или ТипОснования = Тип("ДокументСсылка.ПогашениеЦеннойБумаги") Тогда
		ТекущиеДанные.Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Основание, "ВалютаОплаты");
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗакрытиеКредитногоИнструмента") Тогда 	
		ТекущиеДанные.Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Основание, "РасчетныйСчет.Валюта");
	КонецЕсли;
	
	ЗаполнитьРасчетныеПоляОснованийНаСервере(ТекущиеДанные.НомерСтроки);
	
	ЗаполнитьНастройкиОтображенияНаСервере();
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияСуммаОплатыПриИзменении(Элемент)
	
	ПересчитатьСуммыДолга(Этаформа.Элементы.Основания.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияСуммаОплатыКупонаПриИзменении(Элемент)
	
	ПересчитатьСуммыДолга(Этаформа.Элементы.Основания.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияСуммаПриИзменении(Элемент)
	
	ПересчитатьСуммыОплаты(Этаформа.Элементы.Основания.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияСуммаКупонаПриИзменении(Элемент)
	
	ПересчитатьСуммыОплаты(Этаформа.Элементы.Основания.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияСобственныйКурсОплатыПриИзменении(Элемент)
	
	ТД = Этаформа.Элементы.Основания.ТекущиеДанные;
	
	Если Не ТД.СобственныйКурсОплаты Тогда
		ТД.КурсОплаты = 0;
	КонецЕсли;
	
	Если ТД.СобственныйКурсОплаты И Не ЗначениеЗаполнено(ТД.КурсОплаты) Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьСуммыОплаты(ТД);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияКурсОплатыПриИзменении(Элемент)
	
	ТД = Этаформа.Элементы.Основания.ТекущиеДанные;
	
	Если ТД.СобственныйКурсОплаты И Не ЗначениеЗаполнено(ТД.КурсОплаты) Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьСуммыОплаты(ТД);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияСтавкаНДСПриИзменении(Элемент)
	
	РассчитатьСуммуНДС(Элементы.Основания.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура КомандаПодборОснований(Команда)
	
	// обязательные поля отбора
	ПараметрыПодбора = Новый Структура("МножественныйВыбор", Истина);
	
	// не обязательные поля отбора, передача которых определяется заполненными полями
	ПоляОтбораЗадолженности = "Организация, ВидЗадолженности, СчетДоверительногоУправления, МестоХранения";
	ПоляОтбораЗадолженности = СтрЗаменить(ПоляОтбораЗадолженности, ", ", Символы.ПС);
	
	Для НомСтр = 1 По СтрЧислоСтрок(ПоляОтбораЗадолженности) Цикл
		ПолеОтбораЗадолженности = СтрПолучитьСтроку(ПоляОтбораЗадолженности, НомСтр);
		Если ЗначениеЗаполнено(Объект[ПолеОтбораЗадолженности]) Тогда
			ПараметрыПодбора.Вставить(ПолеОтбораЗадолженности, Объект[ПолеОтбораЗадолженности]);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПодбора.Вставить("Период", РаботаСДокументами.ПолучитьМоментВремени(Объект.Ссылка));
	
	// не обязательные поля, которые соответствуют не 1:1
	Если ЗначениеЗаполнено(Объект.ВидДвижения) Тогда
		ПараметрыПодбора.Вставить("ТипЗадолженности", РаботаСЗадолженностямиКлиентСерверПовтИсп.ПолучитьТипЗадолженностиПоВидуДвижения(Объект.ВидДвижения));
	КонецЕсли;
	
	Если Не ЭтаФорма.ОплатаЧерезБрокера Или (ЭтаФорма.ОплатаЧерезБрокера И ЗначениеЗаполнено(Объект.Брокер)) Тогда
		ПараметрыПодбора.Вставить("Брокер", Объект.Брокер);
	КонецЕсли;
	
	// Также при подборе учтем банковский счет
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда 
		ПараметрыПодбора.Вставить("РасчетныйСчет", Объект.РасчетныйСчет);
	КонецЕсли;
	
	// собственно, подбор
	ХранилищеВыбЗадолженности = ОткрытьФормуМодально("ОбщаяФорма.ПодборЗадолженностиПоДенежнымСредствам", ПараметрыПодбора, ЭтаФорма);
	
	Если ТипЗнч(ХранилищеВыбЗадолженности) = Тип("ХранилищеЗначения") Тогда
		ЗаполнитьОснованияОстаткамиЗадолженностиНаСервере(ХранилищеВыбЗадолженности, Истина);
		Модифицированность = Истина;
	КонецЕсли;
	
	ОснованияПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьОснования(Команда)
	
	Если (Объект.Основания.Количество() > 0 И Вопрос("Очистить таблицу оснований оплаты?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да) Тогда
		Объект.Основания.Очистить();
		ОбновитьИтоговуюСтрокуОснований(ЭтаФорма);
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьИсполнителяПоДенежнымСредствам(Команда)
	
	РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствам(ЭтаФорма, ЭтаФорма.ОплатаЧерезБрокера);
	
	РасчетныйСчетПриИзменении(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	// ЖУУУУУУУУУУУТЬ !!!!!!!!!!!
	Если Объект.ВидЗадолженности.Родитель = Справочники.ВидыЗадолженности.Устаревшие Тогда
		Если Объект.Основания.Количество() > 0 Тогда
			Если ТипЗнч(Объект.Основания[0].Основание) = Тип("ДокументСсылка.НачислениеЗадолженности") Тогда
				Если Объект.ВидЗадолженности <> Объект.Основания[0].Основание.ВидЗадолженности Тогда
					Объект.ВидЗадолженности = Объект.Основания[0].Основание.ВидЗадолженности;
					Сообщить("Обновлен вид задолженности!");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// ЖУУУУУУУУУУУТЬ !!!!!!!!!!!
	
	ЭтаФорма.ОплатаЧерезБрокера           = ОпределитьЗначениеПереключателя(Объект.Брокер, Объект.МестоХранения);
	ЭтаФорма.ДетализацияПоРасчетномуСчету = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(Объект);
	ЭтаФорма.СтрокаБанковскойВыписки      = РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыписки);
	
	ЗаполнитьРасчетныеПоляОснованийНаСервере();
	ЗаполнитьНастройкиОтображенияНаСервере();
	
	ОбновитьИтоговуюСтрокуОснований(ЭтаФорма);
	
	// !!! ВРЕМЕННО НЕ ПРОВЕРЯЕМ (09.10.2024)
	//ОбновитьНеобходимостьПроверкиРеквизитаДоговор();
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	ПроверитьАкцептованиеНаСервере();
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма, Элемент = Неопределено)
	
	Элементы = Форма.Элементы;
	ДанныеОбъекта = Форма.Объект;
	
	Элементы.ОснованияГруппаКурсОплаты.Видимость = Форма.ОтображатьКурсыОплат;
	
	Элементы.МестоХранения.Доступность = (Форма.ОплатаЧерезБрокера <> ЗначениеПереключателяБиржа());
	
	Элементы.Брокер.Видимость = (Форма.ОплатаЧерезБрокера = ЗначениеПереключателяБрокер());
	
	Если Форма.ОплатаЧерезБрокера = ЗначениеПереключателяБиржа() Тогда
		Элементы.КомандаВыбратьИсполнителяПоДенежнымСредствам.Видимость	= Ложь;
		Элементы.РасчетныйСчет.Видимость								= Ложь;
		Элементы.СтрокаБанковскойВыписки.Видимость						= Ложь;
	Иначе
		РаботаСДокументамиКлиентСервер.НастроитьВидимостьИДоступностьРасчетногоСчетаИСвязанныхРеквизитов(Форма);
	КонецЕсли;

	БазовыйТипЗадолженности = ОпределитьБазовыйТипЗадолженности(ДанныеОбъекта.ВидЗадолженности);
	Элементы.Аванс.Доступность = БазовыйТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Кредиторская")
									И ДанныеОбъекта.ВидДвижения = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Расход")
								ИЛИ БазовыйТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Дебиторская")
									И ДанныеОбъекта.ВидДвижения = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Приход");
								
	Элементы.ОбеспечительныйПлатеж.Видимость = ДанныеОбъекта.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоАренде");
	Элементы.ДатаПлановогоПогашенияЗадолженности.Видимость = ДанныеОбъекта.Аванс;
	Элементы.Поручение.Видимость = ДанныеОбъекта.Аванс И (Не ЗначениеЗаполнено(ДанныеОбъекта.ВидЗадолженности) Или ДоступноСозданиеОплатНаОснованииПоручений(ДанныеОбъекта));   
									
	Если ДанныеОбъекта.Аванс 
			И (ДанныеОбъекта.ВидДвижения = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Расход")
				ИЛИ ДанныеОбъекта.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоАренде")) Тогда
		
		Элементы.ОснованияОснование.Видимость 			= Ложь;
		Элементы.ОснованияПлановаяДатаОплаты.Видимость 	= Ложь;
		
		Элементы.ОснованияСуммаОплаты.Видимость       = Истина;
		Элементы.ОснованияСуммаОплатыКупона.Видимость = Ложь;

		Элементы.ОснованияСумма.Видимость       = Истина;
		Элементы.ОснованияСуммаКупона.Видимость = Ложь;
		
		Элементы.ОснованияСуммаЗадолженности.Видимость       = Ложь;
		Элементы.ОснованияСуммаКупонаЗадолженности.Видимость = Ложь;
	
	ИначеЕсли ДанныеОбъекта.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоПогашениюКупона")
		Или ДанныеОбъекта.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона")
		Или ДанныеОбъекта.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода") Тогда
	
		Элементы.ОснованияОснование.Видимость 			= Истина;
		Элементы.ОснованияПлановаяДатаОплаты.Видимость 	= Ложь;
		
		Элементы.ОснованияСуммаОплаты.Видимость       = Ложь;
		Элементы.ОснованияСуммаОплатыКупона.Видимость = Истина;
		
		Элементы.ОснованияСумма.Видимость       = Ложь;
		Элементы.ОснованияСуммаКупона.Видимость = Истина;
		
		Элементы.ОснованияСуммаЗадолженности.Видимость       = Ложь;
		Элементы.ОснованияСуммаКупонаЗадолженности.Видимость = Истина;
		
	ИначеЕсли ДанныеОбъекта.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоСделке")
		Или ДанныеОбъекта.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО")
		Или ДанныеОбъекта.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО") Тогда
	
		Элементы.ОснованияОснование.Видимость          = Истина;
		Элементы.ОснованияПлановаяДатаОплаты.Видимость = Истина;
		
		Элементы.ОснованияСуммаОплаты.Видимость       = Истина;
		Элементы.ОснованияСуммаОплатыКупона.Видимость = Истина;

		Элементы.ОснованияСумма.Видимость       = Истина;
		Элементы.ОснованияСуммаКупона.Видимость = Истина;
		
		Элементы.ОснованияСуммаЗадолженности.Видимость       = Истина;
		Элементы.ОснованияСуммаКупонаЗадолженности.Видимость = Истина;
				
	Иначе
			
		Элементы.ОснованияОснование.Видимость          = Истина;
		Элементы.ОснованияПлановаяДатаОплаты.Видимость = Ложь;
		
		Элементы.ОснованияСуммаОплаты.Видимость       = Истина;
		Элементы.ОснованияСуммаОплатыКупона.Видимость = Ложь;
		
		Элементы.ОснованияСумма.Видимость       = Истина;
		Элементы.ОснованияСуммаКупона.Видимость = Ложь;
		
		Элементы.ОснованияСуммаЗадолженности.Видимость       = Истина;
		Элементы.ОснованияСуммаКупонаЗадолженности.Видимость = Ложь;
		
	КонецЕсли;
	
	Элементы.ОснованияГруппаСуммыВВалютеОплаты.Заголовок = "В валюте оплаты (" + ДанныеОбъекта.ВалютаОплаты + ")";
	
	Элементы.СтраницаБухгалтерия.Видимость = (ДанныеОбъекта.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ОшибочноеСписание")
												ИЛИ ДанныеОбъекта.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоПрочимУслугам"));
	
	Если Элементы.Найти("ФормаОбщаяКомандаПровестиПоБухгалтерскомуУчету") <> Неопределено Тогда
		Элементы.ФормаОбщаяКомандаПровестиПоБухгалтерскомуУчету.Видимость = НЕ БухгалтерскийУчет.ВидЗадолженностиСвязанСПартиями(ДанныеОбъекта.ВидЗадолженности);
	КонецЕсли;
	
	Если Форма.Модифицированность Тогда
		
		ПутьКДаннымСкрываемыхПолей = Новый Структура();

		ПутьКДаннымСкрываемыхПолей.Вставить("ОснованияОснование", "Объект.Основания.Основание");
		ПутьКДаннымСкрываемыхПолей.Вставить("Поручение", "Объект.Поручение");
		ПутьКДаннымСкрываемыхПолей.Вставить("ОснованияПлановаяДатаОплаты", "Объект.Основания.ПлановаяДатаОплаты");				
		ПутьКДаннымСкрываемыхПолей.Вставить("ОснованияСумма", "Объект.Основания.Сумма");
		ПутьКДаннымСкрываемыхПолей.Вставить("ОснованияСуммаОплаты", "Объект.Основания.СуммаОплаты");
		ПутьКДаннымСкрываемыхПолей.Вставить("ОснованияСуммаКупона", "Объект.Основания.СуммаКупона");
		ПутьКДаннымСкрываемыхПолей.Вставить("ОснованияСуммаОплатыКупона", "Объект.Основания.СуммаОплатыКупона");
		ПутьКДаннымСкрываемыхПолей.Вставить("ОснованияГруппаКурсОплаты", РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("Объект.Основания.КурсОплаты, Объект.Основания.СобственныйКурсОплаты", ",", Истина, Истина));
		
		РаботаСФормамиКлиентСервер.ОчиститьЗначенияСкрытыхПолей(Форма, ПутьКДаннымСкрываемыхПолей);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконто(Форма, Организация, Счет)

	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
		"Субконто1",
		"Субконто2",
		"Субконто3",
		"Подразделение");

	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Организация, Счет, Форма, ПоляФормы);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконтоЕПС(Форма, Организация, Счет)

	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоЕПС1",
		"СубконтоЕПС2",
		"СубконтоЕПС3",
		"Подразделение");

	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Организация, Счет, Форма, ПоляФормы);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИтоговуюСтрокуОснований(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	
	ОбщаяСуммаОплаты       = 0;
	ОбщаяСуммаОплатыКупона = 0;
	
	Для каждого СтрокаДанныеОснования Из ДанныеОбъекта.Основания Цикл
		ОбщаяСуммаОплаты       = ОбщаяСуммаОплаты + СтрокаДанныеОснования.СуммаОплаты;
		ОбщаяСуммаОплатыКупона = ОбщаяСуммаОплатыКупона + СтрокаДанныеОснования.СуммаОплатыКупона;
	КонецЦикла;
	
	ИтоговаяСтрокаОснования = "Итого: " + ОбщаяСуммаОплаты + " " + ДанныеОбъекта.ВалютаОплаты;
		
	Если ОбщаяСуммаОплатыКупона > 0 Тогда
		ИтоговаяСтрокаОснования = ИтоговаяСтрокаОснования + ", купона " + ОбщаяСуммаОплатыКупона + " " + ДанныеОбъекта.ВалютаОплаты
			+ ", всего " + (ОбщаяСуммаОплаты + ОбщаяСуммаОплатыКупона) + " " + ДанныеОбъекта.ВалютаОплаты;
	КонецЕсли;			
			
	Форма.Элементы.НадписьИтоговаяСтрокаОснования.Заголовок = ИтоговаяСтрокаОснования;
	
КонецПроцедуры // ОбновитьИтоговуюСтрокуОснований

&НаСервереБезКонтекста
Функция ОпределитьБазовыйТипЗадолженности(ВидЗадолженности)
	Возврат Справочники.ВидыЗадолженности.ОпределитьТипЗадолженности(ВидЗадолженности);
КонецФункции

&НаСервере
Функция ПроверитьНаличиеЗадолженностиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Организация КАК Организация,
		|	&СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	&ТипЗадолженности КАК ТипЗадолженности,
		|	&ВидЗадолженности КАК ВидЗадолженности,
		|	ОснованияОплаты.Основание КАК Основание,
		|	ОснованияОплаты.Валюта КАК Валюта,
		|	ОснованияОплаты.Сумма КАК Сумма,
		|	ОснованияОплаты.СуммаКупона КАК СуммаКупона
		|ПОМЕСТИТЬ _ОснованияОплаты
		|ИЗ
		|	&ОснованияОплаты КАК ОснованияОплаты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОснованияОплаты.Основание КАК Основание,
		|	СУММА(_ОснованияОплаты.Сумма) КАК Сумма,
		|	СУММА(_ОснованияОплаты.СуммаКупона) КАК СуммаКупона,
		|	СУММА(ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток, 0)) КАК СуммаОстаток,
		|	СУММА(ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток, 0)) КАК СуммаКупонаОстаток,
		|	СУММА(ЕСТЬNULL(ЗадолженностиПоДенежнымСредствам.Сумма, 0)) КАК СуммаДвижения,
		|	СУММА(ЕСТЬNULL(ЗадолженностиПоДенежнымСредствам.СуммаКупона, 0)) КАК СуммаКупонаДвижения
		|ИЗ
		|	_ОснованияОплаты КАК _ОснованияОплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ТипЗадолженности = &ТипЗадолженности
		|					И ВидЗадолженности = &ВидЗадолженности
		|					И Валюта В
		|						(ВЫБРАТЬ
		|							_ОснованияОплаты.Валюта
		|						ИЗ
		|							_ОснованияОплаты)
		|					И Основание В
		|						(ВЫБРАТЬ
		|							_ОснованияОплаты.Основание
		|						ИЗ
		|							_ОснованияОплаты)) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|		ПО _ОснованияОплаты.Организация = ЗадолженностиПоДенежнымСредствамОстатки.Организация
		|			И _ОснованияОплаты.СчетДоверительногоУправления = ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления
		|			И _ОснованияОплаты.ТипЗадолженности = ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности
		|			И _ОснованияОплаты.ВидЗадолженности = ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности
		|			И _ОснованияОплаты.Валюта = ЗадолженностиПоДенежнымСредствамОстатки.Валюта
		|			И _ОснованияОплаты.Основание = ЗадолженностиПоДенежнымСредствамОстатки.Основание
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|		ПО (ЗадолженностиПоДенежнымСредствам.Регистратор = &Регистратор)
		|			И _ОснованияОплаты.Организация = ЗадолженностиПоДенежнымСредствам.Организация
		|			И _ОснованияОплаты.СчетДоверительногоУправления = ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления
		|			И _ОснованияОплаты.ТипЗадолженности = ЗадолженностиПоДенежнымСредствам.ТипЗадолженности
		|			И _ОснованияОплаты.ВидЗадолженности = ЗадолженностиПоДенежнымСредствам.ВидЗадолженности
		|			И _ОснованияОплаты.Валюта = ЗадолженностиПоДенежнымСредствам.Валюта
		|			И _ОснованияОплаты.Основание = ЗадолженностиПоДенежнымСредствам.Основание
		|
		|СГРУППИРОВАТЬ ПО
		|	_ОснованияОплаты.Основание
		|
		|ИМЕЮЩИЕ
		|	(СУММА(_ОснованияОплаты.Сумма) > СУММА(ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток, 0)) + СУММА(ЕСТЬNULL(ЗадолженностиПоДенежнымСредствам.Сумма, 0))
		|		ИЛИ СУММА(_ОснованияОплаты.СуммаКупона) > СУММА(ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток, 0)) + СУММА(ЕСТЬNULL(ЗадолженностиПоДенежнымСредствам.СуммаКупона, 0)))";
	
	Запрос.УстановитьПараметр("Период",                       ?(ЗначениеЗаполнено(Объект.Ссылка), Новый МоментВремени(Объект.Дата, Объект.Ссылка), Неопределено));
	Запрос.УстановитьПараметр("Регистратор",                  Объект.Ссылка);
	Запрос.УстановитьПараметр("Организация",                  Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ТипЗадолженности",             РаботаСЗадолженностямиКлиентСерверПовтИсп.ПолучитьТипЗадолженностиПоВидуДвижения(Объект.ВидДвижения));
	Запрос.УстановитьПараметр("ВидЗадолженности",             Объект.ВидЗадолженности);
	Запрос.УстановитьПараметр("ОснованияОплаты",              Объект.Основания.Выгрузить(, "Основание, Валюта, Сумма, СуммаКупона"));
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции // ПроверитьНаличиеЗадолженностиНаСервере

&НаСервереБезКонтекста
Функция ПолучитьВалютуВозвратногоКупона(Основание, Организация, СчетДоверительногоУправления)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода)
		|				И Основание = &Основание) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество()>1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По основанию " + Основание + " обнаружена задолженность по возврату купонного дохода в нескольких валютах! Валюта в документе может быть заполнена некорректно.");
	КонецЕсли;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Валюта;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРасчетныеПоляОснованийНаСервере(НомерСтроки = Неопределено)
	
	Если Объект.Основания.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОснованияОплаты.НомерСтроки КАК НомерСтроки,
		|	ОснованияОплаты.Основание КАК Основание,
		|	ОснованияОплаты.Валюта КАК Валюта
		|ПОМЕСТИТЬ _ОснованияОплаты
		|ИЗ
		|	&ОснованияОплаты КАК ОснованияОплаты
		|ГДЕ
		|	(ОснованияОплаты.НомерСтроки = &НомерСтроки
		|			ИЛИ &НомерСтроки = НЕОПРЕДЕЛЕНО)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОснованияОплаты.Основание,
		|	ОснованияОплаты.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Организация КАК Организация,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК СуммаЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток КАК СуммаКупонаЗадолженности
		|ПОМЕСТИТЬ _ЗадолженностьПоОснованиямОплаты
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ТипЗадолженности = &ТипЗадолженности
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Основание В (&Основания)
		|				И Контрагент = &Контрагент) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УсловияСделокСрезПоследних.Сделка КАК Основание,
		|	УсловияСделокСрезПоследних.ДатаОплаты КАК ДатаОплаты
		|ПОМЕСТИТЬ _УсловияСделок
		|ИЗ
		|	РегистрСведений.УсловияСделок.СрезПоследних(
		|			&Период,
		|			НЕ Отменено
		|				И Сделка В (&Основания)) КАК УсловияСделокСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.ДатаОплаты
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&Период,
		|			НЕ Отменено
		|				И СделкаРЕПО В (&Основания)
		|				И ЧастьСделкиРЕПО = &ЧастьСделкиРЕПО) КАК УсловияСделокРЕПОСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОснованияОплаты.НомерСтроки КАК НомерСтроки,
		|	_УсловияСделок.ДатаОплаты КАК ПлановаяДатаОплаты,
		|	_ЗадолженностьПоОснованиямОплаты.СуммаЗадолженности КАК СуммаЗадолженности,
		|	_ЗадолженностьПоОснованиямОплаты.СуммаКупонаЗадолженности КАК СуммаКупонаЗадолженности
		|ИЗ
		|	_ОснованияОплаты КАК _ОснованияОплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностьПоОснованиямОплаты КАК _ЗадолженностьПоОснованиямОплаты
		|		ПО (_ЗадолженностьПоОснованиямОплаты.ВидЗадолженности = &ВидЗадолженности)
		|			И _ОснованияОплаты.Основание = _ЗадолженностьПоОснованиямОплаты.Основание
		|			И _ОснованияОплаты.Валюта = _ЗадолженностьПоОснованиямОплаты.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияСделок КАК _УсловияСделок
		|		ПО _ОснованияОплаты.Основание = _УсловияСделок.Основание";
		
	Запрос.УстановитьПараметр("ОснованияОплаты",              Объект.Основания.Выгрузить());
	Запрос.УстановитьПараметр("НомерСтроки",                  НомерСтроки);	
	Запрос.УстановитьПараметр("Период",                       Новый Граница(Объект.Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Основания",                    Объект.Основания.Выгрузить(, "Основание").ВыгрузитьКолонку("Основание"));
	Запрос.УстановитьПараметр("ТипЗадолженности",             РаботаСЗадолженностямиКлиентСерверПовтИсп.ПолучитьТипЗадолженностиПоВидуДвижения(Объект.ВидДвижения));
	Запрос.УстановитьПараметр("ВидЗадолженности",             Объект.ВидЗадолженности);
	Запрос.УстановитьПараметр("ЧастьСделкиРЕПО",              РаботаСЗадолженностямиКлиентСерверПовтИсп.ПолучитьЧастьСделкиРЕПОПоВидуЗадолженности(Объект.ВидЗадолженности));
	Запрос.УстановитьПараметр("Организация",                  Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент",                   Объект.Контрагент);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	
	// прямая выгрузка в реквизит не катит, т.к. заметна глазу, поэтому пройдемся циклом по строкам
	Выборка = Запрос.Выполнить().Выбрать();
	
	// почему-то, при заполнении коллекции на форме, теряются значения суммовых полей,
	// а плановая дата (типа "Дата") остается заполненной
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.Основания[Выборка.НомерСтроки - 1], Выборка, "ПлановаяДатаОплаты, СуммаЗадолженности, СуммаКупонаЗадолженности");
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьРасчетныеПоляОснованийНаСервере

&НаСервере
Функция ЗаполнитьОснованияОстаткамиЗадолженностиНаСервере(ХранилищеВыбЗадолженности, ОбновитьРеквизитыШапки = Ложь)
	
	ОстаткиЗадолженности = ХранилищеВыбЗадолженности.Получить();
		
	// при подборе, в ряде случаев, возможен неуникальный ключ тип + вид задолженности
	ВариантыЗадолженности = ОстаткиЗадолженности.Скопировать(, "СчетДоверительногоУправления, ТипЗадолженности, ВидЗадолженности");
	ВариантыЗадолженности.Свернуть("СчетДоверительногоУправления, ТипЗадолженности, ВидЗадолженности", "");
	
	Если ВариантыЗадолженности.Количество() > 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// заполним документ
	
	Для НомСтр = 0 По ОстаткиЗадолженности.Количество() - 1 Цикл
		СтрокаОстаткиЗадолженности = ОстаткиЗадолженности[НомСтр];
		
		НоваяСтрокаОснования = Объект.Основания.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаОснования, СтрокаОстаткиЗадолженности);
		
		НоваяСтрокаОснования.СуммаЗадолженности			 = НоваяСтрокаОснования.Сумма;
		НоваяСтрокаОснования.СуммаКупонаЗадолженности	 = НоваяСтрокаОснования.СуммаКупона;
		
		Если ОбновитьРеквизитыШапки И НомСтр = 0 Тогда
			ЗаполнитьЗначенияСвойств(Объект, СтрокаОстаткиЗадолженности);
			Объект.ВидДвижения = РаботаСЗадолженностямиКлиентСерверПовтИсп.ПолучитьВидДвиженияПоТипуЗадолженности(СтрокаОстаткиЗадолженности.ТипЗадолженности);
			
			Документы.Оплата.ЗаполнитьДатуИВалютуОплатыПоПервойСтрокеОснования(Объект);			
		КонецЕсли;
		
		Документы.Оплата.ЗаполнитьДанныеКонтрагента(Объект, НоваяСтрокаОснования);
	КонецЦикла;
	
	
	Возврат Истина;
	
КонецФункции // ЗаполнитьОснованияОстаткамиЗадолженностиНаСервере

&НаСервере
Процедура ЗаполнитьНастройкиОтображенияНаСервере()
	
	ВыбБрокеры = Новый Массив();
	
	ЭтаФорма.ОтображатьКурсыОплат = Ложь; 
	
	Для каждого СтрокаОснования Из Объект.Основания Цикл
		Если Не ЭтаФорма.ОтображатьКурсыОплат И ЗначениеЗаполнено(Объект.ВалютаОплаты) И ЗначениеЗаполнено(СтрокаОснования.Валюта) И Объект.ВалютаОплаты <> СтрокаОснования.Валюта Тогда
			ЭтаФорма.ОтображатьКурсыОплат = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()

	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		

КонецПроцедуры

&НаКлиенте 
Процедура РассчитатьСуммуНДС(ТекущиеДанные)
	
	СтавкаНДС = РаботаСНалогамиКлиентСервер.ПолучитьСтавкуНДС(ТекущиеДанные.СтавкаНДС);

	ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма * СтавкаНДС/(100 + СтавкаНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммыОплаты(ТД)
		
	КурсВалюты = ?(ТД.СобственныйКурсОплаты, ТД.КурсОплаты, Объект.Дата);
	КурсОплаты = ?(ТД.СобственныйКурсОплаты, ?(ТипЗнч(ТД.КурсОплаты) = Тип("Число"), 1, ТД.КурсОплаты), Объект.Дата);
	
	Коэфициент = РаботаСВалютами.ПересчетСуммыВВалюте(1, ТД.Валюта, КурсВалюты, Объект.ВалютаОплаты, КурсОплаты);
		
	Если ТД.Сумма <> 0 Тогда
		ТД.СуммаОплаты = ТД.Сумма * Коэфициент;	
	КонецЕсли;
	
	Если ТД.СуммаКупона <> 0 Тогда
		ТД.СуммаОплатыКупона = ТД.СуммаКупона * Коэфициент;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммыДолга(ТД)
		
	КурсОплаты = ?(ТД.СобственныйКурсОплаты, ТД.КурсОплаты, Объект.Дата);
	КурсВалюты = ?(ТД.СобственныйКурсОплаты, ?(ТипЗнч(ТД.КурсОплаты) = Тип("Число"), 1, ТД.КурсОплаты), Объект.Дата);
	
	Коэфициент = РаботаСВалютами.ПересчетСуммыВВалюте(1, Объект.ВалютаОплаты, КурсОплаты, ТД.Валюта, КурсВалюты);
		
	Если ТД.СуммаОплаты <> 0 Тогда
		ТД.Сумма = ТД.СуммаОплаты * Коэфициент;	
	КонецЕсли;
	
	Если ТД.СуммаОплатыКупона <> 0 Тогда
		ТД.СуммаКупона = ТД.СуммаОплатыКупона * Коэфициент;	
	КонецЕсли;

	РассчитатьСуммуНДС(Элементы.Основания.ТекущиеДанные);

КонецПроцедуры

&НаСервере
Процедура ПроверитьАкцептованиеНаСервере()
		
	Элементы.ДекорацияАкцептовано.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АкцептованиеОперацийСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.АкцептованиеОпераций.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Регистратор.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВЫБОР
		|					КОГДА &ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
		|						ТОГДА ВидАкцепта = ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.СписаниеБрокерскойКомиссии)
		|					КОГДА &ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|						ТОГДА ВидАкцепта = ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.СписаниеТорговойКомиссии)
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ) КАК АкцептованиеОперацийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И Брокер = &Брокер) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ПО АкцептованиеОперацийСрезПоследних.Операция = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АкцептованиеОперацийСрезПоследних.Регистратор
		|ИЗ
		|	РегистрСведений.АкцептованиеОпераций.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Регистратор.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И (ВЫРАЗИТЬ(Операция КАК Справочник.БанковскиеСчета)) = &РасчетныйСчет
		|				И ВЫБОР
		|					КОГДА &ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.БанковскаяКомиссия))
		|						ТОГДА ВидАкцепта = ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.СписаниеКомиссииБанка)
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ) КАК АкцептованиеОперацийСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АкцептованиеОперацийСрезПоследних.Регистратор
		|ИЗ
		|	РегистрСведений.АкцептованиеОпераций.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И (Операция = &Ссылка
		|					ИЛИ Операция = &СтрокаБанковскойВыписки)) КАК АкцептованиеОперацийСрезПоследних";
		
		Запрос.УстановитьПараметр("Период", 						Объект.Дата);
		Запрос.УстановитьПараметр("Организация", 					Объект.Организация);
		Запрос.УстановитьПараметр("Брокер", 	 					Объект.Брокер);
		Запрос.УстановитьПараметр("РасчетныйСчет", 	 				Объект.РасчетныйСчет);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления",	Объект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ВидЗадолженности",				Объект.ВидЗадолженности);
		Запрос.УстановитьПараметр("Ссылка",							Объект.Ссылка);
		Запрос.УстановитьПараметр("СтрокаБанковскойВыписки",		Объект.СтрокаБанковскойВыписки);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Элементы.ДекорацияАкцептовано.Видимость	= Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область Работа_с_переключателями_отправителя_и_получателя

&НаСервереБезКонтекста
Функция ОпределитьЗначениеПереключателя(Брокер, МестоХранения)

	Если ЗначениеЗаполнено(Брокер) Тогда
		Возврат ЗначениеПереключателяБрокер();
	ИначеЕсли МестоХранения = Справочники.МестаХранения.ММВБ_ДепозитыСЦК Тогда
		Возврат ЗначениеПереключателяБиржа();
	Иначе
		Возврат ЗначениеПереключателяПрямая();
	КонецЕсли;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеПереключателяПрямая()
	Возврат 0;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеПереключателяБрокер()
	Возврат 1;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеПереключателяБиржа()
	Возврат 2;
КонецФункции

&НаСервереБезКонтекста
Функция ДоступноСозданиеОплатНаОснованииПоручений(СтруктураДанныхОбъекта) 
	
	Возврат Документы.Оплата.ФормироватьДвиженияПоЗадолженностиПоДенежнымСредствамПоПоручениям(СтруктураДанныхОбъекта);
			
КонецФункции

&НаСервереБезКонтекста
Функция ДоступноСозданиеОплатыПоВидуЗадолженностиНаОснованииПоручения(ВидЗадолженности)
	
	Возврат Справочники.ВидыЗадолженности.ЭтоВидЗадолженностиДляФормированияПоручений(ВидЗадолженности);
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ОбновитьНеобходимостьПроверкиРеквизитаДоговор()
	НеобходимостьПроверкиРеквизитаДоговор = Документы.Оплата.НеобходимостьПроверкиРеквизитаДоговор(Объект);
	Элементы.Договор.АвтоОтметкаНезаполненного = НеобходимостьПроверкиРеквизитаДоговор И Не ЗначениеЗаполнено(Объект.Договор);
	Если Не Элементы.Договор.АвтоОтметкаНезаполненного Тогда
		Элементы.Договор.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
